Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes.SourceDrawingNameWhenMoved Method
Returns the source drawing name when moved property element type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PropertyElement.PropertyElementType SourceDrawingNameWhenMoved()
Public Shared Function SourceDrawingNameWhenMoved As PropertyElement.PropertyElementType
Return Value
Type: PropertyElement.PropertyElementType
The requested property element type.
See Also
Reference
PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace